// наша 'cms'

const getThumbUrl = (num) =>
  new URL(`./assets/img/${num}-thumb.webp`, import.meta.url).href;
const getFullUrl = (num) =>
  new URL(`./assets/img/${num}-full.webp`, import.meta.url).href;

export const periods = [
  {
    id: 1,
    title: "основание",
    thumbImage: getThumbUrl(1),
    fullImage: getFullUrl(1),
    alt: "Здание Центрального московского ипподрома, старая открытка",
    text: "Центральный московский ипподром основали в 1834 году. Он расположен на территории бывшего Ходынского поля по адресу Беговая улица, дом 22, и является старейшим в России и первым в мире рысистым ипподромом.",
  },
  {
    id: 2,
    title: "перестройка",
    thumbImage: getThumbUrl(2),
    fullImage: getFullUrl(2),
    alt: "Здание ипподрома с квадригой на крыше",
    text: "До 1930 года рысистый и скаковой ипподромы в Москве были раздельными и находились неподалеку друг от друга. В связи с реконструкцией железнодорожного узла Белорусского вокзала встал вопрос о перестройке или переносе скакового ипподрома. Проект слияния двух ипподромов в один – комбинированный – был осуществлен в 1930 году.",
  },
  {
    id: 3,
    title: "вов",
    thumbImage: getThumbUrl(3),
    fullImage: getFullUrl(3),
    alt: "Ворота ипподрома с конной скульптурой зимой",
    text: "В период Великой Отечественной войны лошади были эвакуированы в другие города. На территории ипподрома находились позиции зенитчиков, охранявших небо Москвы от вражеских налетов, а на дорожках проходили подготовку пехотные части. Около 100 сотрудников Центрального Московского ипподрома ушли на фронт добровольцами.",
  },
  {
    id: 4,
    title: "1950-е годы",
    thumbImage: getThumbUrl(4),
    fullImage: getFullUrl(4),
    alt: "Главный корпус ипподрома с колоннадой и квадригой",
    text: "В своем нынешнем виде комплекс объектов ипподрома сформировался в 1950-е годы. Главный корпус и пилоны ворот с конными скульптурами являются объектами культурного наследия регионального значения. Вплоть до конца 1980-х годов это было одно из самых оживленных мест отдыха в столице.",
  },
  {
    id: 5,
    title: "рекорды",
    thumbImage: getThumbUrl(5),
    fullImage: getFullUrl(5),
    alt: "Бега троек на фоне трибун",
    text: "С 1970 по 1983 год на Центральном московском ипподроме рысистые лошади установили более 50 новых всесоюзных рекордов и один абсолютный рекорд.",
  },
  {
    id: 6,
    title: "упадок",
    thumbImage: getThumbUrl(6),
    fullImage: getFullUrl(6),
    alt: "Трибуны ипподрома с башней",
    text: "С 1992 года бега не проводились и возобновились только в 2000-е, но в существенно меньших масштабах, чем в период расцвета. Из-за недостаточности текущего финансирования и вложений в инфраструктуру ипподром стал постепенно приходить в упадок.",
  },
];
